sergz72/usblib/usb_device_stm32f.cpp
  /* Device mode configuration */
  USBx_DEVICE(instance)->DCFG |= DCFG_FRAME_INTERVAL_80;

  if (instance == USB_OTG_FS)
  {
    /* Set Full speed phy */
    USB_SetDevSpeed(instance, USB_OTG_SPEED_FULL);
  }
  else
  {
    /* Set High speed phy */
    USB_SetDevSpeed(instance, USB_OTG_SPEED_HIGH);
  }

  /* Flush the FIFOs */
  USB_FlushTxFifo(instance, 0x10); /* all Tx FIFOs */
  USB_FlushRxFifo(instance);

  /* Clear all pending Device Interrupts */
  USBx_DEVICE(instance)->DIEPMSK = 0;
  USBx_DEVICE(instance)->DOEPMSK = 0;
  USBx_DEVICE(instance)->DAINT = 0xFFFFFFFF;
  USBx_DEVICE(instance)->DAINTMSK = 0;

  for (i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    if ((USBx_INEP(instance, i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA)
      USBx_INEP(instance, i)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
    else
      USBx_INEP(instance, i)->DIEPCTL = 0;

    USBx_INEP(instance, i)->DIEPTSIZ = 0;
    USBx_INEP(instance, i)->DIEPINT  = 0xFF;
  }

  for (i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    if ((USBx_OUTEP(instance, i)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      USBx_OUTEP(instance, i)->DOEPCTL = (USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK);
    }
    else
    {
      USBx_OUTEP(instance, i)->DOEPCTL = 0;
    }

    USBx_OUTEP(instance, i)->DOEPTSIZ = 0;
    USBx_OUTEP(instance, i)->DOEPINT  = 0xFF;
  }

  USBx_DEVICE(instance)->DIEPMSK &= ~USB_OTG_DIEPMSK_TXFURM;

  if (instance != USB_OTG_FS) // dma setup
  {
    /*Set threshold parameters */
    USBx_DEVICE(instance)->DTHRCTL = (USB_OTG_DTHRCTL_TXTHRLEN_6 | USB_OTG_DTHRCTL_RXTHRLEN_6);
    USBx_DEVICE(instance)->DTHRCTL |= (USB_OTG_DTHRCTL_RXTHREN | USB_OTG_DTHRCTL_ISOTHREN | USB_OTG_DTHRCTL_NONISOTHREN);

    i= USBx_DEVICE(instance)->DTHRCTL;
  }

  /* Disable all interrupts. */
  instance->GINTMSK = 0;

  /* Clear any pending interrupts */
  instance->GINTSTS = 0xBFFFFFFF;

  if (instance == USB_OTG_FS)
    instance->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;

  /* Enable interrupts matching to the Device mode ONLY */
  instance->GINTMSK |= (USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST |\
                    USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_IEPINT |\
                    USB_OTG_GINTMSK_OEPINT   | USB_OTG_GINTMSK_IISOIXFRM|\
                    USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM);

  if (manager->SofShouldBeEnabled())
    instance->GINTMSK |= USB_OTG_GINTMSK_SOFM;

  if (cfg->vbus_sensing_enable)
    instance->GINTMSK |= USB_OTG_GINTMSK_SRQIM | USB_OTG_GINTMSK_OTGINT;
}

void USB_SetRxFiFo(USB_OTG_GlobalTypeDef *instance, unsigned int size)
{
  instance->GRXFSIZ = size;
}

void USB_SetTxFiFo(USB_OTG_GlobalTypeDef *instance, unsigned int fifo, unsigned int offset, unsigned int size)
{
  if (!fifo)
    instance->DIEPTXF0_HNPTXFSIZ = (size << 16) | offset;
  else
    instance->DIEPTXF[fifo - 1] = (size << 16) | offset;
}

void USB_Device_STM32F::USB_FIFO_Init() const
{
  unsigned int i, max_size = 0;

  for (i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    unsigned int size = manager->GetEndpointMaxTransferSize(i);
    if (size > max_size)
      max_size = size;
  }
  USB_SetRxFiFo(instance, max_size);
  unsigned int offset = max_size;
  for (i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    unsigned int size = manager->GetEndpointMaxTransferSize(i);
    if (size)
    {
      USB_SetTxFiFo(instance, i, offset, size);
      offset += size;
    }
  }
}

void USB_Device_STM32F::USB_EPInit() const
{
  int i;

  /* Init endpoints structures */
  for (i = 0; i < 15; i++)
    instance->DIEPTXF[i] = 0;
}

void USB_Device_STM32F::AssignEndpointsBuffers()
{
  for (unsigned int i = 0; i <= USB_MAX_ENDPOINTS; i++)
  {
    unsigned int max_transfer_size = manager->GetEndpointMaxTransferSize(i);
    if (max_transfer_size)
      endpoint_buffers_rx[i] = (unsigned char *)malloc(max_transfer_size);
  }
}

void USB_Device_STM32F::Init(USB_DeviceManager *m)
{
  manager = m;

  // disable global interrupt
  instance->GAHBCFG &= ~USB_OTG_GAHBCFG_GINT;

  USB_CoreInit();

  // Set device mode
  instance->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
  delayms(50);

  USB_EPInit();
  USB_DevInit();

  USB_FIFO_Init();
  AssignEndpointsBuffers();
}

void USB_Device_STM32F::InitXferBuffers()
{
  for (unsigned int i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    xfer_data[i].pointer = endpoint_buffers_rx[i];
    xfer_data[i].length = 0;
  }
}

void USB_Device_STM32F::Reset()
{
  SetAddress(0);
  InitXferBuffers();
}

void USB_Device_STM32F::Connect()
{
  if (instance == USB_OTG_FS)
    NVIC_Init(OTG_FS_IRQn, 1, 3, ENABLE);
#ifdef USB_OTG_HS
  else
    NVIC_Init(OTG_HS_IRQn, 1, 3, ENABLE);
#endif
  //Enables the controller's Global Int in the AHB Config reg
  instance->GAHBCFG |= USB_OTG_GAHBCFG_GINT;

  USBx_DEVICE(instance)->DCTL &= ~USB_OTG_DCTL_SDIS;
  //delayms(3);
}

void USB_Device_STM32F::SetEndpointTransferType(unsigned int endpoint, USBEndpointTransferType transfer_type)
{
  unsigned int value_in = USBx_INEP(instance, endpoint)->DIEPCTL & ~USB_OTG_DIEPCTL_EPTYP;
  unsigned int value_out = USBx_OUTEP(instance, endpoint)->DOEPCTL & ~USB_OTG_DOEPCTL_EPTYP;
  unsigned int ttype = transfer_type << 18;
  unsigned int direction = manager->GetEndpointDirection(endpoint);
  unsigned int ep_int_pos = 1 << endpoint;

  switch (direction)
  {
    case usb_endpoint_direction_in:
      USBx_INEP(instance, endpoint)->DIEPCTL = value_in | ttype | USB_OTG_DIEPCTL_USBAEP | USB_OTG_DIEPCTL_SD0PID_SEVNFRM | (endpoint << 22 );
      USBx_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_IEPM & ep_int_pos;
      break;
    case usb_endpoint_direction_out:
      USBx_OUTEP(instance, endpoint)->DOEPCTL = value_out | ttype | USB_OTG_DOEPCTL_USBAEP | USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
      USBx_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_OEPM & (ep_int_pos << 16);
      break;
    case usb_endpoint_direction_inout:
      USBx_INEP(instance, endpoint)->DIEPCTL = value_in | ttype | USB_OTG_DIEPCTL_USBAEP | USB_OTG_DIEPCTL_SD0PID_SEVNFRM | (endpoint << 22 );
      USBx_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_IEPM & ep_int_pos;
      USBx_OUTEP(instance, endpoint)->DOEPCTL = value_out | ttype | USB_OTG_DOEPCTL_USBAEP | USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
      USBx_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_OEPM & (ep_int_pos << 16);
      break;
  }
}

void USB_Device_STM32F::ConfigureEndpoint(unsigned int endpoint_no, USBEndpointConfiguration rx_config,
                                        USBEndpointConfiguration tx_config)
{
  ConfigureEndpointRX(endpoint_no, rx_config);
  ConfigureEndpointTX(endpoint_no, tx_config);
}

