sergz72/usblib/usb_device_stm32f.cpp
void USB_Device_STM32F::ConfigureEndpointRX(unsigned int endpoint_no, USBEndpointConfiguration config)
{
  unsigned int value = USBx_INEP(instance, endpoint_no)->DIEPCTL & ~USB_OTG_DIEPCTL_STALL;
  switch (config)
  {
    case usb_endpoint_configuration_enabled: value |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA; break;
    case usb_endpoint_configuration_nak: value |= USB_OTG_DIEPCTL_SNAK | USB_OTG_DIEPCTL_EPENA; break;
    case usb_endpoint_configuration_stall: value |= USB_OTG_DIEPCTL_STALL | USB_OTG_DIEPCTL_EPENA; break;
    default: value |= USB_OTG_DIEPCTL_EPDIS; break;
  }
  USBx_INEP(instance, endpoint_no)->DIEPCTL = value;
}

void USB_Device_STM32F::ConfigureEndpointTX(unsigned int endpoint_no, USBEndpointConfiguration config)
{
  unsigned int value = USBx_OUTEP(instance, endpoint_no)->DOEPCTL & ~USB_OTG_DOEPCTL_STALL;
  switch (config)
  {
    case usb_endpoint_configuration_enabled: value |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA; break;
    case usb_endpoint_configuration_nak: value |= USB_OTG_DOEPCTL_SNAK | USB_OTG_DOEPCTL_EPENA; break;
    case usb_endpoint_configuration_stall: value |= USB_OTG_DOEPCTL_STALL | USB_OTG_DOEPCTL_EPENA; break;
    default: value |= USB_OTG_DOEPCTL_EPDIS; break;
  }
  USBx_OUTEP(instance, endpoint_no)->DOEPCTL = value;
}

/**
  * @brief  USB_WritePacket : Writes a packet into the Tx FIFO associated
  *         with the EP/channel
  * @param  src :  pointer to source buffer
  * @param  ch_ep_num : endpoint or host channel number
  * @param  len : Number of bytes to write
  * @retval none
  */
static void USB_WritePacket(USB_OTG_GlobalTypeDef *instance, const unsigned char *src, unsigned int ch_ep_num, unsigned int len)
{
  unsigned int count32b, i;

  if (instance == USB_OTG_FS)
  {
    count32b = (len + 3) / 4;
    for (i = 0; i < count32b; i++, src += 4)
      USBx_DFIFO(instance, ch_ep_num) = *((unsigned int*)src);
  }
}

void USB_Device_STM32F::SetEndpointData(unsigned int endpoint_no, const void *data, unsigned int length)
{
  unsigned int temp = USBx_INEP(instance, endpoint_no)->DIEPTSIZ & ~(USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ);
  USBx_INEP(instance, endpoint_no)->DIEPTSIZ = temp | (1 << 19) | length;
  USB_WritePacket(instance, (const unsigned char *)data, endpoint_no, length);
  ConfigureEndpointTX(endpoint_no, usb_endpoint_configuration_enabled);
}

void USB_Device_STM32F::ZeroTransfer(unsigned int endpoint_no)
{
  unsigned int temp = USBx_INEP(instance, endpoint_no)->DIEPTSIZ & ~(USB_OTG_DIEPTSIZ_PKTCNT | USB_OTG_DIEPTSIZ_XFRSIZ);
  USBx_INEP(instance, endpoint_no)->DIEPTSIZ = temp | (1 << 19);
  ConfigureEndpointTX(endpoint_no, usb_endpoint_configuration_enabled);
}

unsigned int GetEndpointRxLength(unsigned int endpoint)
{
  //todo
  return 0;
}

/**
  * @brief  USB_ReadPacket : read a packet from the Tx FIFO associated
  *         with the EP/channel
  * @param  dest : destination pointer
  * @param  len : Number of bytes to read
  * @retval pointer to destination buffer
  */
static void USB_ReadPacket(USB_OTG_GlobalTypeDef *instance, unsigned char *dest, unsigned int len)
{
  unsigned int i;
  unsigned int count32b = (len + 3) / 4;

  for ( i = 0; i < count32b; i++, dest += 4 )
    *((unsigned int*)dest) = USBx_DFIFO(instance, 0);
}

/**
  * @brief  USB_ReadDevAllOutEpInterrupt: return the USB device OUT endpoints interrupt status
  * @retval status
  */
static unsigned int USB_ReadDevAllOutEpInterrupt(USB_OTG_GlobalTypeDef *instance)
{
  unsigned int v = USBx_DEVICE(instance)->DAINT;
  v &= USBx_DEVICE(instance)->DAINTMSK;
  return ((v & 0xffff0000) >> 16);
}

/**
  * @brief  Returns Device OUT EP Interrupt register
  * @param  epnum : endpoint number
  *          This parameter can be a value from 0 to 15
  * @retval Device OUT EP Interrupt register
  */
static unsigned int USB_ReadDevOutEPInterrupt(USB_OTG_GlobalTypeDef *instance, unsigned int epnum)
{
  unsigned int v = USBx_OUTEP(instance, epnum)->DOEPINT;
  v &= USBx_DEVICE(instance)->DOEPMSK;
  return v;
}

void USB_Device_STM32F::USBRSTHandler()
{
  unsigned int i;

  USBx_DEVICE(instance)->DCTL &= ~USB_OTG_DCTL_RWUSIG;
  USB_FlushTxFifo(instance, 0);

  for (i = 0; i < USB_MAX_ENDPOINTS; i++)
  {
    USBx_INEP(instance, i)->DIEPINT = 0xFF;
    USBx_OUTEP(instance, i)->DOEPINT = 0xFF;
  }
  USBx_DEVICE(instance)->DAINT = 0xFFFFFFFF;
  USBx_DEVICE(instance)->DAINTMSK |= 0x10001;

  USBx_DEVICE(instance)->DOEPMSK |= USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM | USB_OTG_DOEPMSK_EPDM | USB_OTG_DOEPMSK_OTEPSPRM;
  USBx_DEVICE(instance)->DIEPMSK |= USB_OTG_DIEPMSK_TOM | USB_OTG_DIEPMSK_XFRCM | USB_OTG_DIEPMSK_EPDM;

  manager->Reset();

  instance->GINTSTS = USB_OTG_GINTSTS_USBRST;
}

void USB_Device_STM32F::OEPINTHandler()
{
  unsigned int epnum, ep_intr, epint;

  epnum = 0;

  /* Read in the device interrupt bits */
  ep_intr = USB_ReadDevAllOutEpInterrupt(instance);

  while (ep_intr)
  {
    if (ep_intr & 1)
    {
      epint = USB_ReadDevOutEPInterrupt(instance, epnum);

      if((epint & USB_OTG_DOEPINT_XFRC) == USB_OTG_DOEPINT_XFRC)
      {
        CLEAR_OUT_EP_INTR(instance, epnum, USB_OTG_DOEPINT_XFRC);

        manager->DataPacketReceived(epnum, endpoint_buffers_rx[epnum], xfer_data[epnum].length);
        xfer_data[epnum].length = 0;
        xfer_data[epnum].pointer = endpoint_buffers_rx[epnum];
      }

      if((epint & USB_OTG_DOEPINT_STUP) == USB_OTG_DOEPINT_STUP)
      {
        // Inform the upper layer that a setup packet is available
        manager->SetupPacketReceived(endpoint_buffers_rx[epnum]);
        CLEAR_OUT_EP_INTR(instance, epnum, USB_OTG_DOEPINT_STUP);
      }

      if((epint & USB_OTG_DOEPINT_OTEPDIS) == USB_OTG_DOEPINT_OTEPDIS)
      {
        CLEAR_OUT_EP_INTR(instance, epnum, USB_OTG_DOEPINT_OTEPDIS);
      }
      // Clear Status Phase Received interrupt
      if((epint & USB_OTG_DOEPINT_OTEPSPR) == USB_OTG_DOEPINT_OTEPSPR)
      {
        CLEAR_OUT_EP_INTR(instance, epnum, USB_OTG_DOEPINT_OTEPSPR);
      }
    }
    epnum++;
    ep_intr >>= 1;
  }
}

/**
  * @brief  USB_ReadDevAllInEpInterrupt: return the USB device IN endpoints interrupt status
  * @retval status
  */
static unsigned int USB_ReadDevAllInEpInterrupt (USB_OTG_GlobalTypeDef *instance)
{
  unsigned int v;
  v  = USBx_DEVICE(instance)->DAINT;
  v &= USBx_DEVICE(instance)->DAINTMSK;
  return v & 0xFFFF;
}

/**
  * @brief  Returns Device IN EP Interrupt register
  * @param  epnum : endpoint number
  *          This parameter can be a value from 0 to 15
  * @retval Device IN EP Interrupt register
  */
static unsigned int USB_ReadDevInEPInterrupt(USB_OTG_GlobalTypeDef *instance, unsigned int epnum)
{
  unsigned int v, msk, emp;

  msk = USBx_DEVICE(instance)->DIEPMSK;
  emp = USBx_DEVICE(instance)->DIEPEMPMSK;
  msk |= ((emp >> epnum) & 0x1) << 7;
  v = USBx_INEP(instance, epnum)->DIEPINT & msk;
  return v;
}

void USB_Device_STM32F::IEPINTHandler()
{
  unsigned int epnum, ep_intr, epint, fifoemptymsk;

  epnum = 0;

  /* Read in the device interrupt bits */
  ep_intr = USB_ReadDevAllInEpInterrupt(instance);

  while ( ep_intr )
  {
    if (ep_intr & 0x1) /* In ITR */
    {
      epint = USB_ReadDevInEPInterrupt(instance, epnum);

      if(( epint & USB_OTG_DIEPINT_XFRC) == USB_OTG_DIEPINT_XFRC)
      {
        fifoemptymsk = 0x1 << epnum;
        USBx_DEVICE(instance)->DIEPEMPMSK &= ~fifoemptymsk;

        CLEAR_IN_EP_INTR(instance, epnum, USB_OTG_DIEPINT_XFRC);

        manager->ContinueTransfer(epnum);
      }
      if(( epint & USB_OTG_DIEPINT_TOC) == USB_OTG_DIEPINT_TOC)
      {
        CLEAR_IN_EP_INTR(instance, epnum, USB_OTG_DIEPINT_TOC);
      }
      if(( epint & USB_OTG_DIEPINT_ITTXFE) == USB_OTG_DIEPINT_ITTXFE)
      {
        CLEAR_IN_EP_INTR(instance, epnum, USB_OTG_DIEPINT_ITTXFE);
      }
      if(( epint & USB_OTG_DIEPINT_INEPNE) == USB_OTG_DIEPINT_INEPNE)
      {
        CLEAR_IN_EP_INTR(instance, epnum, USB_OTG_DIEPINT_INEPNE);
      }
      if(( epint & USB_OTG_DIEPINT_EPDISD) == USB_OTG_DIEPINT_EPDISD)
      {
        CLEAR_IN_EP_INTR(instance, epnum, USB_OTG_DIEPINT_EPDISD);
      }
      /*if(( epint & USB_OTG_DIEPINT_TXFE) == USB_OTG_DIEPINT_TXFE)
      {
        USB_WriteEmptyTxFifo(instance, epnum);
      }*/
    }
    epnum++;
    ep_intr >>= 1;
  }
}

void USB_Device_STM32F::InterruptHandler()
{
  unsigned int status = instance->GINTSTS;
  status &= instance->GINTMSK;

  if (status & USB_OTG_GINTSTS_RXFLVL)
  {
    USB_MASK_INTERRUPT(instance, USB_OTG_GINTSTS_RXFLVL);

    unsigned int temp = instance->GRXSTSP;
    unsigned int length = (temp & USB_OTG_GRXSTSP_BCNT) >> 4;

    if (length)
    {
      unsigned int ep_no = temp & USB_OTG_GRXSTSP_EPNUM;
      USB_ReadPacket(instance, xfer_data[ep_no].pointer, length);
      xfer_data[ep_no].pointer += length;
      xfer_data[ep_no].length += length;
    }

