sergz72/usblib/usb_device_stm32f.cpp
    USB_UNMASK_INTERRUPT(instance, USB_OTG_GINTSTS_RXFLVL);
    return;
  }

  /* Handle SOF Interrupt */
  if(status & USB_OTG_GINTSTS_SOF)
  {
    manager->Sof();
    instance->GINTSTS = USB_OTG_GINTSTS_SOF;
    return;
  }

  if (status & USB_OTG_GINTSTS_OEPINT)
  {
    OEPINTHandler();
  }

  if (status & USB_OTG_GINTSTS_IEPINT)
  {
    IEPINTHandler();
  }

  if (status & USB_OTG_GINTSTS_MMIS)
  {
    /* incorrect mode, acknowledge the interrupt */
    instance->GINTSTS = USB_OTG_GINTSTS_MMIS;
  }

  /* Handle Resume Interrupt */
  if (status & USB_OTG_GINTSTS_WKUINT)
  {
    /* Clear the Remote Wake-up Signaling */
    USBx_DEVICE(instance)->DCTL &= ~USB_OTG_DCTL_RWUSIG;

    manager->Resume();

    instance->GINTSTS = USB_OTG_GINTSTS_WKUINT;
  }

  /* Handle Suspend Interrupt */
  if (status & USB_OTG_GINTSTS_USBSUSP)
  {
    if((USBx_DEVICE(instance)->DSTS & USB_OTG_DSTS_SUSPSTS) == USB_OTG_DSTS_SUSPSTS)
      manager->Suspend();
    instance->GINTSTS = USB_OTG_GINTSTS_USBSUSP;
  }

  /* Handle Reset Interrupt */
  if (status & USB_OTG_GINTSTS_USBRST)
  {
    USBRSTHandler();
  }

  /* Handle Enumeration done Interrupt */
  if (status & USB_OTG_GINTSTS_ENUMDNE)
  {
    unsigned int temp = instance->GUSBCFG & ~USB_OTG_GUSBCFG_TRDT;
    instance->GUSBCFG = temp | (instance == USB_OTG_FS ? 6 << 10 : 9 << 10);

    //manager->Reset();

    instance->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
  }

  /* Handle Incomplete ISO IN Interrupt */
  if(status & USB_OTG_GINTSTS_IISOIXFR)
  {
    //todo
    instance->GINTSTS = USB_OTG_GINTSTS_IISOIXFR;
  }

  /* Handle Incomplete ISO OUT Interrupt */
  if(status & USB_OTG_GINTSTS_PXFR_INCOMPISOOUT)
  {
    //todo
    instance->GINTSTS = USB_OTG_GINTSTS_PXFR_INCOMPISOOUT;
  }

  /* Handle Connection event Interrupt */
  if(status & USB_OTG_GINTSTS_SRQINT)
  {
    //todo
    instance->GINTSTS = USB_OTG_GINTSTS_SRQINT;
  }

  /* Handle Disconnection event Interrupt */
  if(status & USB_OTG_GINTSTS_OTGINT)
  {
    unsigned int temp = instance->GOTGINT;

    //todo

    instance->GOTGINT |= temp;
  }
}

void USB_Device_STM32F::SetAddress(unsigned short address)
{
  unsigned int temp = USBx_DEVICE(instance)->DCFG & ~USB_OTG_DCFG_DAD;
  USBx_DEVICE(instance)->DCFG = temp | ((address << 4) & USB_OTG_DCFG_DAD);
}

const unsigned int USB_Device_STM32F::GetEnabledEndpoints()
{
#ifdef STM32F7
  if (instance == USB_OTG_FS)
    return 0x03F; // 6 endpoints
  else
    return 0x1FF; // 9 endpoints
#else
  return 0x0F; // 4 endpoints
#endif
}
